In [15]:
import pandas as pd
import numpy as np
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],
                                          [ 1,2,3,1,3,1,2,2,3]])
data

a  1   -0.078147
   2    0.655151
   3   -0.584253
b  1    0.424066
   3    0.250528
c  1    1.426307
   2   -0.654618
d  2   -1.355311
   3   -0.174563
dtype: float64

In [16]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [17]:
data['b':'c']

b  1    0.424066
   3    0.250528
c  1    1.426307
   2   -0.654618
dtype: float64

In [18]:
data.iloc[5:7]

c  1    1.426307
   2   -0.654618
dtype: float64

In [19]:
data[:,2]

a    0.655151
c   -0.654618
d   -1.355311
dtype: float64

In [20]:
data.loc[['b','d']]

b  1    0.424066
   3    0.250528
d  2   -1.355311
   3   -0.174563
dtype: float64

In [21]:
x=pd.DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],
                                    [ 1,2,1,2]],columns=[['ohio','colorado','ohio'],
                                                          ['green','red','green']])
x

     ohio colorado  ohio
    green      red green
a 1     0        1     2
  2     3        4     5
b 1     6        7     8
  2     9       10    11

In [22]:
x.index.names=['key1','key2']
x

           ohio colorado  ohio
          green      red green
key1 key2
a    1        0        1     2
     2        3        4     5
b    1        6        7     8
     2        9       10    11

In [23]:
x.columns.names=['state','colour']
x

state      ohio colorado  ohio
colour    green      red green
key1 key2
a    1        0        1     2
     2        3        4     5
b    1        6        7     8
     2        9       10    11

In [24]:
x.index.nlevels

2

In [25]:
x.unstack() # reshape the dataframe by convert column to row.

state   ohio    colorado      ohio
colour green         red     green
key2       1  2        1   2     1   2
key1
a          0  3        1   4     2   5
b          6  9        7  10     8  11

In [27]:
data.unstack().stack()# it will not work if columns has duplicate value.

a  1   -0.078147
   2    0.655151
   3   -0.584253
b  1    0.424066
   3    0.250528
c  1    1.426307
   2   -0.654618
d  2   -1.355311
   3   -0.174563
dtype: float64

In [28]:
x.unstack().stack(level=0)

C:\Users\E 555\AppData\Local\Temp\ipykernel_7472\1313969227.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  x.unstack().stack(level=0)

colour        green      red
key2              1   2    1     2
key1 state
a    colorado     0   3  1.0   4.0
     ohio         2   5  NaN   NaN
b    colorado     6   9  7.0  10.0
     ohio         8  11  NaN   NaN

In [29]:
x.unstack().stack(level=1)

C:\Users\E 555\AppData\Local\Temp\ipykernel_7472\66299775.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  x.unstack().stack(level=1)

state       ohio     colorado
key2           1   2        1     2
key1 colour
a    green     0   3      NaN   NaN
     red       2   5      1.0   4.0
b    green     6   9      NaN   NaN
     red       8  11      7.0  10.0

In [30]:
x.swaplevel('key1','key2') # it will swap the index and value remains same

state      ohio colorado  ohio
colour    green      red green
key2 key1
1    a        0        1     2
2    a        3        4     5
1    b        6        7     8
2    b        9       10    11

In [33]:
x.sort_index(level=1)# it will sort the index at the level 1(key2),value remains unchanged

state      ohio colorado  ohio
colour    green      red green
key1 key2
a    1        0        1     2
b    1        6        7     8
a    2        3        4     5
b    2        9       10    11

In [34]:
x.swaplevel(0,1).sort_index(level=0)# it will swap the index and sort the index according to the level

state      ohio colorado  ohio
colour    green      red green
key2 key1
1    a        0        1     2
     b        6        7     8
2    a        3        4     5
     b        9       10    11

In [35]:
x.swaplevel(0,1).sort_index(level=1)

state      ohio colorado  ohio
colour    green      red green
key2 key1
1    a        0        1     2
2    a        3        4     5
1    b        6        7     8
2    b        9       10    11

In [40]:
frame=pd.DataFrame({'a':range(7),
                   'b':range(7,0,-1),
                    'c':['one','one','one','two','two','two','two'],
                   'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [44]:
frame.set_index('c','d')

TypeError: set_index() takes 2 positional arguments but 3 were given